tutorials/multiphase/interFoam/RAS/mixerVesselAMI/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7  
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    vessel
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    oilInlet
    {
        type            fixedValue;
        value           uniform (0 0 0.2);
    }
    outlet
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }
    shaftRotating
    {
        type            movingWallVelocity;
        value           uniform (0 0 0);
    }
    shaft
    {
        type            rotatingWallVelocity;
        origin          (0 0 0);
        axis            (0 0 1);
        omega           constant -5;
        value           uniform (0 0 0);
    }
    sparger
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    stirrer
    {
        type            movingWallVelocity;
        value           uniform (0 0 0);
    }
    baffles
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    AMI1
    {
        type            cyclicAMI;
        value           uniform (0 0 0);
    }
    AMI2
    {
        type            cyclicAMI;
        value           uniform (0 0 0);
    }
}


// ************************************************************************* //
